refactor lots of docs
